In [1]:
import pandas as pd
import numpy as np

# Создание столбцов
Заполните пропуски ____ так, чтобы создать из списков два столбца **series**, а затем вывести столбец, заполненный единицами или True в тех местах, где эти столбцы совпадают.
Так, чтобы получилось:

|    |   0 |
|---:|----:|
|  0 |   0 |
|  1 |   0 |
|  2 |   0 |
|  3 |   0 |
|  4 |   1 |

In [2]:
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 10])

In [3]:
print(ds1 == ds2)

0    False
1    False
2    False
3    False
4     True
dtype: bool

# Разные способы создавать таблицы DataFrame
### 1. Заполните пропуски ____ так, чтобы создать таблицу с именоваными строками, чтобы получилась такая таблица:

|    | name      |   score |   attempts | qualify   |
|:---|:----------|--------:|-----------:|:----------|
| a  | Anastasia |    12.5 |          1 | yes       |
| b  | Dima      |     9   |          3 | no        |
| c  | Katherine |    16.5 |          2 | yes       |
| d  | James     |   nan   |          3 | no        |
| e  | Emily     |     9   |          2 | no        |
| f  | Michael   |    20   |          3 | yes       |
| g  | Matthew   |    14.5 |          1 | yes       |
| h  | Laura     |   nan   |          1 | no        |
| i  | Kevin     |     8   |          2 | no        |
| j  | Jonas     |    19   |          1 | yes       |

In [4]:
# NaN - т.е. пустое значение - добавляются с помощью NumPy
# столбцы в таблице можно задать с помощью словаря
# тут ничего исправлять не нужно

exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [5]:
# вспомните, какой аргумент позволяет задать именованые индексы для строк
# колонки мы в прошлый раз задавали с помощью аргумента "columns", а индексы - с помощью аргумента ...

df = pd.DataFrame(exam_data , index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### 2. Выведите её первые три этой таблицы

In [6]:
# выведите первые три строки таблицы
# вспоминайте, с помощью каких функций получать доступ к строкам по имени (loc), а с помощью каких - по индексу

df_three_rows = df.iloc[:3]
df_three_rows

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [7]:
assert str(df_three_rows) == "        name  score  attempts qualify\na  Anastasia   12.5         1     yes\nb       Dima    9.0         3      no\nc  Katherine   16.5         2     yes"

### 3. Добавьте к таблице новый столбец "Color"

In [8]:
# как получать доступ к столбцам таблиц? Что-то там про аналогию со словарями
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color'] = color
df

        name  score  attempts qualify   color
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes  Orange
d      James    NaN         3      no     Red
e      Emily    9.0         2      no   White
f    Michael   20.0         3     yes   White
g    Matthew   14.5         1     yes    Blue
h      Laura    NaN         1      no   Green
i      Kevin    8.0         2      no   Green
j      Jonas   19.0         1     yes     Red

In [9]:
assert str(df) == "        name  score  attempts qualify   color\na  Anastasia   12.5         1     yes     Red\nb       Dima    9.0         3      no    Blue\nc  Katherine   16.5         2     yes  Orange\nd      James    NaN         3      no     Red\ne      Emily    9.0         2      no   White\nf    Michael   20.0         3     yes   White\ng    Matthew   14.5         1     yes    Blue\nh      Laura    NaN         1      no   Green\ni      Kevin    8.0         2      no   Green\nj      Jonas   19.0         1     yes     Red"

### 4. Выведите таблицу, поменяв колонки местами там, чтобы получилось

|    | color   |   score |   attempts | name      | qualify   |
|:---|:--------|--------:|-----------:|:----------|:----------|
| a  | Red     |    12.5 |          1 | Anastasia | yes       |
| b  | Blue    |     9   |          3 | Dima      | no        |
| c  | Orange  |    16.5 |          2 | Katherine | yes       |
| d  | Red     |   nan   |          3 | James     | no        |
| e  | White   |     9   |          2 | Emily     | no        |
| f  | White   |    20   |          3 | Michael   | yes       |
| g  | Blue    |    14.5 |          1 | Matthew   | yes       |
| h  | Green   |   nan   |          1 | Laura     | no        |
| i  | Green   |     8   |          2 | Kevin     | no        |
| j  | Red     |    19   |          1 | Jonas     | yes       |

In [10]:
# заметьте, исходную таблицу эта операция не поменяет
# нужно создать новую

df_new_order = df[['color', 'score', 'attempts', 'name', 'qualify']]
df_new_order

    color  score  attempts       name qualify
a     Red   12.5         1  Anastasia     yes
b    Blue    9.0         3       Dima      no
c  Orange   16.5         2  Katherine     yes
d     Red    NaN         3      James      no
e   White    9.0         2      Emily      no
f   White   20.0         3    Michael     yes
g    Blue   14.5         1    Matthew     yes
h   Green    NaN         1      Laura      no
i   Green    8.0         2      Kevin      no
j     Red   19.0         1      Jonas     yes

In [11]:
assert str(df_new_order) == "    color  score  attempts       name qualify\na     Red   12.5         1  Anastasia     yes\nb    Blue    9.0         3       Dima      no\nc  Orange   16.5         2  Katherine     yes\nd     Red    NaN         3      James      no\ne   White    9.0         2      Emily      no\nf   White   20.0         3    Michael     yes\ng    Blue   14.5         1    Matthew     yes\nh   Green    NaN         1      Laura      no\ni   Green    8.0         2      Kevin      no\nj     Red   19.0         1      Jonas     yes"